## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # argocd_application.metrics-server will be created
+   resource "argocd_application" "metrics-server" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "metrics-server"
+           namespace        = (known after apply)
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

+           source {
+               path            = "charts/metrics-server"
+               repo_url        = "https://github.com/kubernetes-sigs/metrics-server"
+               target_revision = "master"

+               helm {
+                   release_name = "metrics-server"
                }
            }
        }
    }

  # argocd_project.metrics-server will be destroyed
  # (because argocd_project.metrics-server is not in configuration)
-   resource "argocd_project" "metrics-server" {
-       id = "metrics-server" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 2 -> null
-           labels           = {
-               "environment" = "dev"
            } -> null
-           name             = "metrics-server" -> null
-           namespace        = "argocd" -> null
-           resource_version = "6752136" -> null
-           uid              = "a305cac8-46e9-4513-a3de-48c59ba2cd6f" -> null
        }

-       spec {
-           description    = "Metrics Server" -> null
-           signature_keys = [] -> null
-           source_repos   = [
-               "https://github.com/kubernetes-sigs/metrics-server",
            ] -> null

-           cluster_resource_whitelist {
-               group = "*" -> null
-               kind  = "*" -> null
            }

-           destination {
-               namespace = "kube-system" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }

-           namespace_resource_whitelist {
-               group = "*" -> null
-               kind  = "*" -> null
            }
        }
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-wxxsw" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
